ali/acme-get-ssl-ca.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-07-15 三 10:27 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>acme申请 Let’s Encrypt 泛域名 SSL 证书</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="liushangliang" />

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="https://phenix3443.github.io/"> HOME </a>
</div><div id="content">
<h1 class="title">acme申请 Let’s Encrypt 泛域名 SSL 证书</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org6ff67d8">1. 概述</a></li>
<li><a href="#orgbbfaacc">2. 安装</a></li>
<li><a href="#org5568576">3. 申请证书</a></li>
<li><a href="#org5eca405">4. 安装证书</a></li>
</ul>
</div>
</div>


<div id="outline-container-org6ff67d8" class="outline-2">
<h2 id="org6ff67d8"><span class="section-number-2">1</span> 概述</h2>
<div class="outline-text-2" id="text-1">
<p>
<a href="certbot-get-ssl-ca.html">《certbot申请 Let's Encrypt泛域名证书》</a> 一文中介绍了使用 Let's Encrypte 官方客户端申请泛域名证书的方法，但是申请和续期过程需要手动介入，现在介绍一种更加自动化的方法。
</p>

<p>
<a href="https://github.com/Neilpang/acme.sh">acme.sh</a> 是一个实现了 acme 协议的脚本，可以从 Let's Encrypt 生成免费的 SSL 证书。
</p>

<p>
以下所有步骤参照了<a href="https://github.com/Neilpang/acme.sh/wiki/%E8%AF%B4%E6%98%8E">acme.sh官方wiki</a>，由于脚本更新频繁，将来以下步骤可能不适合，请大家直接参考 wiki。
</p>
</div>
</div>

<div id="outline-container-orgbbfaacc" class="outline-2">
<h2 id="orgbbfaacc"><span class="section-number-2">2</span> 安装</h2>
<div class="outline-text-2" id="text-2">
<pre class="example">
curl https://get.acme.sh | sh
</pre>
<p>
将程序安装在 <code>~/.acme.sh/</code> 下。
</p>

<p>
以后更新 acme 程序：
</p>
<pre class="example">
acme.sh --upgrade
</pre>
</div>
</div>

<div id="outline-container-org5568576" class="outline-2">
<h2 id="org5568576"><span class="section-number-2">3</span> 申请证书</h2>
<div class="outline-text-2" id="text-3">
<p>
添加 dns api 相关 key 和秘钥。
</p>
<pre class="example">
export Ali_Key="ali-key"
export Ali_Secret="ali-secret"
</pre>
<p>
会将秘钥信息保存在： <code>~/.acme.sh/account.conf</code> 中，方便下面申请证书和以后证书续期使用。
</p>

<p>
申请证书：
</p>
<div class="org-src-container">
<pre class="src src-sh">acme.sh --issue --dns dns_ali -d panghuli.cn -d *.panghuli.cn
</pre>
</div>
<p>
该命令会将申请的证书放在 <code>~/.acme.sh/panghuli.cn/</code> 下。
</p>

<p>
该命令会添加定时任务，自动检测证书是否过期，并且续期。
</p>
<div class="org-src-container">
<pre class="src src-sh">crontab -l
50 0 * * * <span style="color: #ff4ea3;">"/root/.acme.sh"</span>/acme.sh --cron --home <span style="color: #ff4ea3;">"/root/.acme.sh"</span> &gt; /dev/null
</pre>
</div>

<p>
列出已经申请的证书信息：
</p>
<div class="org-src-container">
<pre class="src src-sh">./acme.sh --list
</pre>
</div>
</div>
</div>

<div id="outline-container-org5eca405" class="outline-2">
<h2 id="org5eca405"><span class="section-number-2">4</span> 安装证书</h2>
<div class="outline-text-2" id="text-4">
<p>
前面证书生成以后，接下来需要把证书 copy 到真正需要用它的地方.
</p>

<p>
注意，默认生成的证书都放在安装目录下: ~/.acme.sh/, 请不要直接使用此目录下的文件，例如：不要直接让 nginx/apache 的配置文件使用这下面的文件。这里面的文件都是内部使用，而且目录结构可能会变化.
</p>

<p>
正确的使用方法是使用 &#x2013;installcert 命令，并指定目标位置，然后证书文件会被 copy 到相应的位置， 例如:
</p>

<div class="org-src-container">
<pre class="src src-sh">acme.sh --installcert  -d  panghuli.cn  -d *.panghuli.cn <span style="color: #ff4ea3;">\</span>
        --ca-file /root/ssl/ca.cer <span style="color: #ff4ea3;">\</span>
        --cert-file /root/ssl/panghuli.cn.cer <span style="color: #ff4ea3;">\</span>
        --key-file   /root/ssl/panghuli.cn.key <span style="color: #ff4ea3;">\</span>
        --fullchain-file /root/ssl/fullchain.cer <span style="color: #ff4ea3;">\</span>
        --reloadcmd  <span style="color: #ff4ea3;">"service nginx force-reload"</span>
</pre>
</div>

<p>
注意：如果是阿里云 ECS ，需要先使用 <code>service nginx start</code> 启动 nginx.service ,否则上面的命令会报错 “nginx.service is not active, cannot reload.”
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: liushangliang</p>
<p class="email">Email: <a href="mailto:phenix3443+github@gmail.com">phenix3443+github@gmail.com</a></p>
<p class="date">Created: 2020-07-15 三 10:27</p>
<p class="validation"></p>
</div>
</body>
</html>
